In [2]:
import pandas as pd
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35 , 60000], ['Harry', 29, 58000]]
df = pd.DataFrame(data, columns=['Name', 'Age', 'Salary'])

In [3]:
type(df), type(df['Name'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [4]:
df.shape

(4, 3)

In [5]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Harry   29   58000

In [6]:
df.info

<bound method DataFrame.info of     Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Harry   29   58000>

In [7]:
df['Name']

0      Dan
1     John
2    Helen
3    Harry
Name: Name, dtype: object

In [8]:
df.Name

0      Dan
1     John
2    Helen
3    Harry
Name: Name, dtype: object

In [9]:
df.Age

0    30
1    40
2    35
3    29
Name: Age, dtype: int64

In [10]:
df['Phone'] = ['124578', '987654', '147852', '456123']

In [11]:
df

    Name  Age  Salary   Phone
0    Dan   30   40000  124578
1   John   40   50000  987654
2  Helen   35   60000  147852
3  Harry   29   58000  456123

In [12]:
df.drop(2, 0)

    Name  Age  Salary   Phone
0    Dan   30   40000  124578
1   John   40   50000  987654
3  Harry   29   58000  456123

In [13]:
df.drop('Age', axis=1)

    Name  Salary   Phone
0    Dan   40000  124578
1   John   50000  987654
2  Helen   60000  147852
3  Harry   58000  456123

In [14]:
df.drop('Age', axis=1, inplace=True) # borra realmente

In [15]:
df

    Name  Salary   Phone
0    Dan   40000  124578
1   John   50000  987654
2  Helen   60000  147852
3  Harry   58000  456123

In [16]:
df.drop(1)

    Name  Salary   Phone
0    Dan   40000  124578
2  Helen   60000  147852
3  Harry   58000  456123

In [17]:
df.rename(columns={'Name': 'First Name', 'Salary': 'Anual Salary'}, inplace=True)

In [18]:
df

  First Name  Anual Salary   Phone
0        Dan         40000  124578
1       John         50000  987654
2      Helen         60000  147852
3      Harry         58000  456123

In [19]:
df.columns = ['First Name', 'Anual Salary', 'Mobile Phones']

In [20]:
df

  First Name  Anual Salary Mobile Phones
0        Dan         40000        124578
1       John         50000        987654
2      Helen         60000        147852
3      Harry         58000        456123

In [21]:
df

  First Name  Anual Salary Mobile Phones
0        Dan         40000        124578
1       John         50000        987654
2      Helen         60000        147852
3      Harry         58000        456123

In [22]:
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35 , 60000], ['Harry', 29, 58000]]
df = pd.DataFrame(data, columns=['Name', 'Age', 'Salary'])

In [23]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Harry   29   58000

In [24]:
df.iloc[0]

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [25]:
df.loc[0]

Name        Dan
Age          30
Salary    40000
Name: 0, dtype: object

In [26]:
df.iloc[0, 1]

30

In [27]:
df.iloc[0:3] # exluye el ultimo en rango, loc lo incluye

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000

In [28]:
df.iloc[[1,3],0:2]

    Name  Age
1   John   40
3  Harry   29

In [29]:
df.sample(frac=0.5)

    Name  Age  Salary
1   John   40   50000
3  Harry   29   58000

In [30]:
dict(zip(df['Name'], df['Age']))

{'Dan': 30, 'John': 40, 'Helen': 35, 'Harry': 29}

In [31]:
df['Salary'] > 50000

0    False
1    False
2     True
3     True
Name: Salary, dtype: bool

In [32]:
df[df['Salary'] > 50000]

    Name  Age  Salary
2  Helen   35   60000
3  Harry   29   58000

In [34]:
df[df.loc[:,'Salary'] > 50000]

    Name  Age  Salary
2  Helen   35   60000
3  Harry   29   58000

In [35]:
df[df.loc[:,'Salary'] > 50000]['Name']

2    Helen
3    Harry
Name: Name, dtype: object

In [37]:
df[df.loc[:, 'Age'] == 30]

  Name  Age  Salary
0  Dan   30   40000

In [40]:

df[~(df.loc[:, 'Salary'] == 58000)]

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000

In [41]:
df['Salary'].max()

60000

In [42]:
df.Age.min()

29

In [46]:
r = df['Salary'].idxmax()
r

2

In [47]:
df.iloc[r]

Name      Helen
Age          35
Salary    60000
Name: 2, dtype: object

In [48]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Harry   29   58000

In [49]:
df.set_index('Salary', inplace=True)

In [50]:
df

         Name  Age
Salary
40000     Dan   30
50000    John   40
60000   Helen   35
58000   Harry   29

In [51]:
df.reset_index()

   Salary   Name  Age
0   40000    Dan   30
1   50000   John   40
2   60000  Helen   35
3   58000  Harry   29

In [52]:
df

         Name  Age
Salary
40000     Dan   30
50000    John   40
60000   Helen   35
58000   Harry   29

In [53]:
df.reset_index(inplace=True)

In [54]:
df

   Salary   Name  Age
0   40000    Dan   30
1   50000   John   40
2   60000  Helen   35
3   58000  Harry   29

In [55]:
df.set_index('Salary', inplace=True)
df

         Name  Age
Salary
40000     Dan   30
50000    John   40
60000   Helen   35
58000   Harry   29

In [56]:
df.loc[50000]

Name    John
Age       40
Name: 50000, dtype: object

In [57]:
df.iloc[1]

Name    John
Age       40
Name: 50000, dtype: object

In [59]:
df.set_index('Name', inplace=True)
df

       Age
Name
Dan     30
John    40
Helen   35
Harry   29

In [60]:
df.loc['John']

Age    40
Name: John, dtype: int64

In [61]:
df.iloc[1]

Age    40
Name: John, dtype: int64

In [62]:
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35 , 60000], ['Harry', 29, 58000]]
df = pd.DataFrame(data, columns=['Name', 'Age', 'Salary'])
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Harry   29   58000

In [63]:
df[(df['Salary'] > 50000) & (df['Age'] > 30)]

    Name  Age  Salary
2  Helen   35   60000

In [65]:
df[(df['Salary'] > 50000) | (df['Age'] < 30)]

    Name  Age  Salary
2  Helen   35   60000
3  Harry   29   58000

In [67]:
df[df['Salary'].between(45000,59000)]

    Name  Age  Salary
1   John   40   50000
3  Harry   29   58000